## Website CMS
**✅ &nbsp; Terraform Format:** `success`
**✅ &nbsp; Terraform Plan:** `success`
**✅ &nbsp; Conftest:** `success`




**⚠️ &nbsp; WARNING:** resources will be destroyed by this change!


```terraform
Plan: 1 to add, 2 to change, 1 to destroy
```


<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
  ~ update in-place
-/+ destroy and then create replacement
 <= read (data resources)

Terraform will perform the following actions:

  # data.template_file.cms_app will be read during apply
  # (config refers to values not yet known)
 <= data "template_file" "cms_app"  {
      ~ id       = "5ae7a3cb77397fc7c0c7cc746da6f3fe7c589c341eff6502244b14e5c4d86c32" -> (known after apply)
      ~ rendered = jsonencode(
            [
              - {
                  - environment      = [
                      - {
                          - name  = "NODE_ENV"
                          - value = "production"
                        },
                      - {
                          - name  = "DATABASE_HOST"
                          - value = "strapi.cnpapuat1xtk.ca-central-1.rds.amazonaws.com"
                        },
                      - {
                          - name  = "BUCKET_NAME"
                          - value = "cds-website-assets-prod"
                        },
                      - {
                          - name  = "DATABASE_USERNAME"
                          - value = "postgres"
                        },
                    ]
                  - image            = "773858180673.dkr.ecr.ca-central-1.amazonaws.com/cds-website/cms"
                  - logConfiguration = {
                      - logDriver = "awslogs"
                      - options   = {
                          - awslogs-group         = "ecs-cds-website-cms"
                          - awslogs-region        = "ca-central-1"
                          - awslogs-stream-prefix = "ecs-cds-website-cms"
                        }
                    }
                  - name             = "cds-website-cms"
                  - portMappings     = [
                      - {
                          - containerPort = 1337
                        },
                    ]
                  - secrets          = [
                      - {
                          - name      = "DATABASE_PASSWORD"
                          - valueFrom = "arn:aws:ssm:ca-central-1:773858180673:parameter/website/db_password"
                        },
                      - {
                          - name      = "TOKEN"
                          - valueFrom = "arn:aws:ssm:ca-central-1:773858180673:parameter/website/github_token"
                        },
                      - {
                          - name      = "ADMIN_JWT_SECRET"
                          - valueFrom = "arn:aws:ssm:ca-central-1:773858180673:parameter/website/admin_jwt_secret"
                        },
                    ]
                },
            ]
        ) -> (known after apply)
        # (2 unchanged attributes hidden)
    }

  # aws_db_instance.website-cms-database will be updated in-place
  ~ resource "aws_db_instance" "website-cms-database" {
      ~ engine_version                        = "10.18" -> "10.21"
        id                                    = "strapi"
        name                                  = "strapi"
        tags                                  = {
            "CostCenter" = "website-cms"
            "Name"       = "website-cms-database"
        }
        # (56 unchanged attributes hidden)
    }

  # aws_ecs_service.website-cms-ecs will be updated in-place
  ~ resource "aws_ecs_service" "website-cms-ecs" {
        id                                 = "arn:aws:ecs:ca-central-1:773858180673:service/website-cms-cluster/website-cms-ecs"
        name                               = "website-cms-ecs"
        tags                               = {}
      ~ task_definition                    = "arn:aws:ecs:ca-central-1:773858180673:task-definition/website-cms-task:62" -> (known after apply)
        # (14 unchanged attributes hidden)




        # (4 unchanged blocks hidden)
    }

  # aws_ecs_task_definition.cds-website-cms must be replaced
-/+ resource "aws_ecs_task_definition" "cds-website-cms" {
      ~ arn                      = "arn:aws:ecs:ca-central-1:773858180673:task-definition/website-cms-task:62" -> (known after apply)
      ~ container_definitions    = jsonencode(
            [
              - {
                  - cpu              = 0
                  - environment      = [
                      - {
                          - name  = "BUCKET_NAME"
                          - value = "cds-website-assets-prod"
                        },
                      - {
                          - name  = "DATABASE_HOST"
                          - value = "strapi.cnpapuat1xtk.ca-central-1.rds.amazonaws.com"
                        },
                      - {
                          - name  = "DATABASE_USERNAME"
                          - value = "postgres"
                        },
                      - {
                          - name  = "NODE_ENV"
                          - value = "production"
                        },
                    ]
                  - essential        = true
                  - image            = "773858180673.dkr.ecr.ca-central-1.amazonaws.com/cds-website/cms"
                  - logConfiguration = {
                      - logDriver = "awslogs"
                      - options   = {
                          - awslogs-group         = "ecs-cds-website-cms"
                          - awslogs-region        = "ca-central-1"
                          - awslogs-stream-prefix = "ecs-cds-website-cms"
                        }
                    }
                  - mountPoints      = []
                  - name             = "cds-website-cms"
                  - portMappings     = [
                      - {
                          - containerPort = 1337
                          - hostPort      = 1337
                          - protocol      = "tcp"
                        },
                    ]
                  - secrets          = [
                      - {
                          - name      = "DATABASE_PASSWORD"
                          - valueFrom = "arn:aws:ssm:ca-central-1:773858180673:parameter/website/db_password"
                        },
                      - {
                          - name      = "TOKEN"
                          - valueFrom = "arn:aws:ssm:ca-central-1:773858180673:parameter/website/github_token"
                        },
                      - {
                          - name      = "ADMIN_JWT_SECRET"
                          - valueFrom = "arn:aws:ssm:ca-central-1:773858180673:parameter/website/admin_jwt_secret"
                        },
                    ]
                  - volumesFrom      = []
                },
            ]
        ) -> (known after apply) # forces replacement
      ~ id                       = "website-cms-task" -> (known after apply)
      ~ revision                 = 62 -> (known after apply)
      - tags                     = {} -> null
      ~ tags_all                 = {} -> (known after apply)
        # (8 unchanged attributes hidden)
    }

Plan: 1 to add, 2 to change, 1 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: plan.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "plan.tfplan"
Releasing state lock. This may take a few moments...

```

</details>

<details>
<summary>Show Conftest results</summary>

```sh
WARN - plan.json - main - Missing Common Tags: ["aws_alb.cms-load-balancer"]
WARN - plan.json - main - Missing Common Tags: ["aws_alb_listener.front_end"]
WARN - plan.json - main - Missing Common Tags: ["aws_alb_target_group.app"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudfront_distribution.s3_distribution"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_log_group.cds-website-cms"]
WARN - plan.json - main - Missing Common Tags: ["aws_db_instance.website-cms-database"]
WARN - plan.json - main - Missing Common Tags: ["aws_db_subnet_group.website-cms"]
WARN - plan.json - main - Missing Common Tags: ["aws_default_network_acl.website-cms"]
WARN - plan.json - main - Missing Common Tags: ["aws_ecr_repository.image-repository"]
WARN - plan.json - main - Missing Common Tags: ["aws_ecs_cluster.website-cms-cluster"]
WARN - plan.json - main - Missing Common Tags: ["aws_ecs_service.website-cms-ecs"]
WARN - plan.json - main - Missing Common Tags: ["aws_ecs_task_definition.cds-website-cms"]
WARN - plan.json - main - Missing Common Tags: ["aws_eip.website-cms[0]"]
WARN - plan.json - main - Missing Common Tags: ["aws_eip.website-cms[1]"]
WARN - plan.json - main - Missing Common Tags: ["aws_iam_policy.ecs-task-execution"]
WARN - plan.json - main - Missing Common Tags: ["aws_iam_role.ecs-task-execution-role"]
WARN - plan.json - main - Missing Common Tags: ["aws_iam_role.task_role"]
WARN - plan.json - main - Missing Common Tags: ["aws_internet_gateway.website-cms"]
WARN - plan.json - main - Missing Common Tags: ["aws_kms_key.cw"]
WARN - plan.json - main - Missing Common Tags: ["aws_nat_gateway.gw[0]"]
WARN - plan.json - main - Missing Common Tags: ["aws_nat_gateway.gw[1]"]
WARN - plan.json - main - Missing Common Tags: ["aws_route_table.website-cms-private_subnet[0]"]
WARN - plan.json - main - Missing Common Tags: ["aws_route_table.website-cms-private_subnet[1]"]
WARN - plan.json - main - Missing Common Tags:...
```

</details>
